package th.ac.nu.student.u54341741.compro.ch03;

import java.util.Scanner;

public class Horoscope {
    public static void main (String [] args){
        
        Scanner in = new Scanner (System.in);
        System.out.print("Enter date is : " );
        String Date = in.next();
        System.out.print("Enter month is : " );
        String Month = in.next();
        
        System.out.println("Please enter your birthday is (Month and Date) : "+ Month + " " + Date);
        System.out.println("Enter horoscope is");
        String January = "ความรักหากมัวแต่อยู่นิ่งๆเงียบๆคนโสดมีโอกาสเฉาได้ต้องทำตัวน่าสนใจ"
                + "\nการงานถึงเวาเอาจิงเอาจัง หากยิ่งขยันก็จะยิ่งก้าวหน้า"
                + "\nการเงินมีการเก็บหอมรอมริบไว้เป็นกอบเป็นกำ";
        String Febuary = "เด็กๆมาวนเวียน คนโสดมีแนวโน้มคบหาคนอายุน้อยกว่า"
                + "\nการงานเหนื่อยกายเหนื่อยใจปัญหารุมเร้า"
                + "\nการเงินบานปลายสุดๆ จับจ่ายใช้สอยอะไรคงต้องรัดเข็มขัด";
        String March = "ความรักเศร้าสลดคาดหวังอะไรจากความรักไม่ค่อยได้"
                + "\nการงานอาจจะถูกโยกย้ายเปลี่ยนงาน"
                + "\nการเงินไม่ค่อยอยู่ติดมือ ได้มาก็มีเหตุให้ต้องจ่ายออก";
        String April = "หารักจริงหวังแต่งยากต้องค่อยๆศึกษากันไปก่อน อย่าเชื่อคนง่าย"
                + "\nการงานดันไปขวางหูขวางตาผู้ใหญ่ จะหยิบจับอะไรก็ลำบาก"
                + "\nการเงินไม่ค่อยดีนัก มีรายจ่ายใหญ่ๆ โดยเฉพาะเกี่ยวกับเรื่องรถ";
        String May = "คนโสดกลายเป็นจุดเด่น มีคนมารุมหมายปอง"
                + "\nการงานเฉลียวฉลาดคล่องแคล่ว ผู้ใหญ่ให้ความเอ็นดู"
                + "\nการเงินเอาตัวรอดได้ดี มักได้ของถูกใจมาแบบฟรีๆจากการใช้ไหวพริบ";
        String June = "กำลังเนื้อหอม มีคนมารุมจีบ คนโสดไม่ค่อยเหงา ลองเลือกแบบที่ชอบ"
                + "\nการงานแม้ไม่โดเด่นมาก แต่ก็ไม่เป็นลองใคร"
                + "\nการเงินมีโชคลาภ เหมาะกับการเสี่ยงลุ้นหรือการลงทุน";
        String July = "ความรักเริ่มรู้สึกสนใจเด็กๆ หรือคนอายุน้อยกว่ามาก"
                + "\nการงานไม่ค่อยหยุดนิ่ง มีเรื่องให้ต้องเดินทางตลอด"
                + "\nการเงินช่วงต้นไม่น่าห่วงแต่มารั่วช่วงปลายต้องวางแผนการใช้จ่ายให้ดีจะได้ไม่ขัดสน";
        String August = "คนโสดเสน่ห์แรงสุดๆ มีคนตามจีบได้สละโสดอย่างแน่นอน"
                + "\nการงานกำลังมีชื่อเสียง ได้รับการยอมรับ"
                + "\nการเงินยิ้มร่า มีเงินก้องวิ่งเข้ามาหา";
        String September = "ความรักแบบลุ่มๆดอนๆ เดี๋ยวรักเดี๋ยวเลิกทำตัวเหมือนซุปตาร์"
                + "\nการงานเอาแน่นอนไม่ค่อยได้ อาจถูกปลดหรือบอกเลิกจ้า"
                + "\nการเงินเห็นทีจะทานไว้ไม่อยู่ มีรายจ่ายเยอะแยะมากมาย";
        String October = "มีคนเข้ามาทำให้ซู่ซ่า เป็นประสบการณ์ที่แปลกใหม่ที่ไม่เคยเจอ อย่าพึ่งตกลงปลงใจ"
                + "\nการงานมักได้รับโอกาสในการเริ่มโครงการใหม่ได้ทำในสิ่งที่ไม่เคยทำมาก่อน"
                + "\nการเงินกำลังผลิดอกออกผล จะลงทุนก็รีบได้เลย";
        String November = "รู้สึกเหงาๆ ทั้งคนที่มีแฟนแล้ว และคนที่ยังโสด"
                + "\nการงานไม่ค่อยเป็นที่น่าพอใจ มีดวงในการเปลี่ยนงาน "
                + "\nการเงินมีดวงได้ลาภจากการเดินทางหรือที่มาจากคนไกลสภาพคล่องดีมาก";
        String December = "คนโสดถ้ายังอยู่นิ่งๆเงียบๆ ก็คงต้องเหงาต่อไป คนมีแฟนรู้สึกอบอุ่น"
                + "\nการงานเป็นช่วงที่ต้องแข่งขันต้องเรียนรู้เพิ่มเติมถึงจะโดเด่นกว่าคนอื่น"
                + "\nการเงินแม้ไม่โดเด่นมาก แต่ก็เอาตัวรอด เพราะมีการวางแผนอย่างดี";
        
        switch (Month){
            case "1" : System.out.println(January)  ; break;
            case "2" : System.out.println(Febuary)  ; break;
            case "3" : System.out.println(March)    ; break;
            case "4" : System.out.println(April)    ; break;
            case "5" : System.out.println(May)      ; break;
            case "6" : System.out.println(June)     ; break;
            case "7" : System.out.println(July)     ; break;
            case "8" : System.out.println(August)   ; break;
            case "9" : System.out.println(September); break;
            case "10": System.out.println(October)  ; break;
            case "11": System.out.println(November) ; break;
            case "12": System.out.println(December) ; break;
            default  : System.out.println()         ; break;       
    }
                        
    }   
}
